In [28]:
import pandas as pd

In [29]:
df = pd.DataFrame({
    'Index': [1,2,3],
    'city': ['Patna', 'Alwar', 'Bikaner'],
    'Temp': [38,39,40] 
})
df

   Index     city  Temp
0      1    Patna    38
1      2    Alwar    39
2      3  Bikaner    40

   Index     city  Temp
0      1    Patna    38
1      2    Alwar    39
2      3  Bikaner    40

Empty DataFrame
Columns: []
Index: [Alwar, Bikaner, Patna]

In [ ]:
pd.crosstab

city
Patna      38
Alwar      39
Bikaner    40
Name: Temp, dtype: int64